app/controllers/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "todos" SET "notes" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["notes", "The check engine light is on in the Tacoma2"], ["updated_at", "2015-08-29 07:55:30.494037"], ["id", 4]]
---
	def update
		@todo= Todo.find(params[:id])
		if @todo.update_attributes(todo_params)

INSERT INTO "todos" ("title", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sima"], ["notes", "wash dishes"], ["created_at", "2015-08-29 10:18:39.440751"], ["updated_at", "2015-08-29 10:18:39.440751"]]
---
	def create
		@todo=Todo.new(todo_params)

		if todo_params[:title].present? && todo_params[:notes].present?

			if @todo.save